# Import Libraries

In [1]:
import pandas as pd
import numpy as np

Read Data

In [2]:
df = pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

Info of Data

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

Statistic Info of Data

In [4]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

Check for missing or null values

In [5]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

Copy Data for Further Use

In [6]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()
df9 = df.copy()
df10 = df.copy()
df11 = df.copy()
df12 = df.copy()

# Without Encoding Techniques

On Sex Column

In [7]:
sex_unique = df1['sex'].unique()
sex_unique

array(['female', 'male'], dtype=object)

In [8]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [9]:
df1['sex'] = df1['sex'].replace(sex_unique,[1,2])
df1.head()

   age  sex     bmi  children smoker     region      charges
0   19    1  27.900         0    yes  southwest  16884.92400
1   18    2  33.770         1     no  southeast   1725.55230
2   28    2  33.000         3     no  southeast   4449.46200
3   33    2  22.705         0     no  northwest  21984.47061
4   32    2  28.880         0     no  northwest   3866.85520

On Smoker Column

In [10]:
smoker_unique = df1['smoker'].unique()
smoker_unique

array(['yes', 'no'], dtype=object)

In [11]:
df1['smoker'] = df1['smoker'].replace(smoker_unique,[3,4])
df1.head()

   age  sex     bmi  children  smoker     region      charges
0   19    1  27.900         0       3  southwest  16884.92400
1   18    2  33.770         1       4  southeast   1725.55230
2   28    2  33.000         3       4  southeast   4449.46200
3   33    2  22.705         0       4  northwest  21984.47061
4   32    2  28.880         0       4  northwest   3866.85520

On region Column

In [12]:
region_unique = df1['region'].unique()
region_unique

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [13]:
df1['region'] = df1['region'].replace(region_unique,[5,6,7,8])
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       3       5  16884.92400
1   18    2  33.770         1       4       6   1725.55230
2   28    2  33.000         3       4       6   4449.46200
3   33    2  22.705         0       4       7  21984.47061
4   32    2  28.880         0       4       7   3866.85520

# Label Encoder

In [14]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [15]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

On sex Column

In [16]:
df2['sex'] = le.fit_transform(df2['sex'])
df2.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

On Smoker Column

In [17]:
df2['smoker'] = le.fit_transform(df2['smoker'])
df2.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       1  southwest  16884.92400
1   18    1  33.770         1       0  southeast   1725.55230
2   28    1  33.000         3       0  southeast   4449.46200
3   33    1  22.705         0       0  northwest  21984.47061
4   32    1  28.880         0       0  northwest   3866.85520

On Region Column

In [18]:
df2['region'] = le.fit_transform(df2['region'])
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# Label Encoder Using For Loop

In [19]:
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [20]:
from pandas.core.dtypes.common import is_numeric_dtype

for col in df3.columns:
    if is_numeric_dtype(df3[col]):
        continue
    df3[col] = le.fit_transform(df3[col])

In [21]:
df3.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoder

On Sex Columns

In [22]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [23]:
sex_dummies = pd.get_dummies(df4['sex'],prefix='sex')
sex_dummies

      sex_female  sex_male
0              1         0
1              0         1
2              0         1
3              0         1
4              0         1
...          ...       ...
1333           0         1
1334           1         0
1335           1         0
1336           1         0
1337           1         0

[1338 rows x 2 columns]

In [24]:
sex_dum = pd.get_dummies(df4['sex'],prefix='sex',drop_first=True)#dummy variable trap
sex_dum

      sex_male
0            0
1            1
2            1
3            1
4            1
...        ...
1333         1
1334         0
1335         0
1336         0
1337         0

[1338 rows x 1 columns]

In [25]:
df4_encoded = pd.concat([df4,sex_dummies],axis=1).drop('sex',axis=1)
df4_encoded.head()

   age     bmi  children smoker     region      charges  sex_female  sex_male
0   19  27.900         0    yes  southwest  16884.92400           1         0
1   18  33.770         1     no  southeast   1725.55230           0         1
2   28  33.000         3     no  southeast   4449.46200           0         1
3   33  22.705         0     no  northwest  21984.47061           0         1
4   32  28.880         0     no  northwest   3866.85520           0         1

On smoker Column

In [26]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [27]:
smoker_dummies = pd.get_dummies(df4['smoker'],prefix='smoker',drop_first=True)
smoker_dummies.head()

   smoker_yes
0           1
1           0
2           0
3           0
4           0

In [28]:
df4_encoded_2 = pd.concat([df4,smoker_dummies],axis=1).drop('smoker',axis=1)
df4_encoded_2.head()

   age     sex     bmi  children     region      charges  smoker_yes
0   19  female  27.900         0  southwest  16884.92400           1
1   18    male  33.770         1  southeast   1725.55230           0
2   28    male  33.000         3  southeast   4449.46200           0
3   33    male  22.705         0  northwest  21984.47061           0
4   32    male  28.880         0  northwest   3866.85520           0

On Region Column

In [29]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [30]:
region_dummies = pd.get_dummies(df4['region'],prefix='region',drop_first=True)
region_dummies.head()

   region_northwest  region_southeast  region_southwest
0                 0                 0                 1
1                 0                 1                 0
2                 0                 1                 0
3                 1                 0                 0
4                 1                 0                 0

In [31]:
df4_encoded_3 = pd.concat([df4,region_dummies],axis=1).drop('region',axis=1)
df4_encoded_3.head()

,age,sex,bmi,children,smoker,charges,region_northwest,region_southeast,region_southwest
0,19,female,27.900,0,yes,16884.92400,0,0,1
1,18,male,33.770,1,no,1725.55230,0,1,0
2,28,male,33.000,3,no,4449.46200,0,1,0
3,33,male,22.705,0,no,21984.47061,1,0,0
4,32,male,28.880,0,no,3866.85520,1,0,0

# One Hot Encoder Using For Loop

In [32]:
df5.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [33]:
for col in df5.columns:
    if is_numeric_dtype(df5[col]):
        continue
    else:
        one = pd.get_dummies(df5[col],prefix=col)
        df5 = pd.concat([df5,one],axis=1).drop(col,axis=1)

In [34]:
df5.head()

,age,bmi,children,charges,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,1,0,0,1,0,0,0,1
1,18,33.770,1,1725.55230,0,1,1,0,0,0,1,0
2,28,33.000,3,4449.46200,0,1,1,0,0,0,1,0
3,33,22.705,0,21984.47061,0,1,1,0,0,1,0,0
4,32,28.880,0,3866.85520,0,1,1,0,0,1,0,0

In [35]:
df6.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [36]:
cols = ['sex','smoker','region']

In [37]:
for col in cols:
    one = pd.get_dummies(df6[col],drop_first=True,prefix=col)#dummy varibale trap
    df6 = pd.concat([df6,one],axis=1).drop(col,axis=1)

In [38]:
df6.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal Encoder

In [39]:
df7.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

On Sex Column

In [40]:
df7['sex'].unique()

array(['female', 'male'], dtype=object)

In [41]:
sex_unique = ['female', 'male']

In [42]:
from sklearn.preprocessing import OrdinalEncoder
oe = OrdinalEncoder(categories=[sex_unique])

In [43]:
df7['sex'] = oe.fit_transform(df7[['sex']])
df7.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

On smoker Column

In [44]:
smoke_unique = df7['smoker'].unique()

In [45]:
oe2 = OrdinalEncoder(categories=[smoke_unique])
df7['smoker'] = oe2.fit_transform(df7[['smoker']])
df7.head()

   age  sex     bmi  children  smoker     region      charges
0   19  0.0  27.900         0     0.0  southwest  16884.92400
1   18  1.0  33.770         1     1.0  southeast   1725.55230
2   28  1.0  33.000         3     1.0  southeast   4449.46200
3   33  1.0  22.705         0     1.0  northwest  21984.47061
4   32  1.0  28.880         0     1.0  northwest   3866.85520

On region Column

In [46]:
region_unique = df7['region'].unique()

In [47]:
oe3 = OrdinalEncoder(categories=[region_unique])
df7['region'] = oe3.fit_transform(df7[['region']])
df7.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

# Ordinal Encoder Using For Loop

In [48]:
df8.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [49]:
for col in df8.columns:
    if is_numeric_dtype(df8[col]):
        continue
    else:
        oe = OrdinalEncoder(categories = [df8[col].unique()])
        df8[col] = oe.fit_transform(df8[[col]])

In [50]:
df8.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520